In [2]:
people = {
    "first": ["Corey", 'Jane', 'John'],
    "last": ["Schafer", 'Doe', 'Doe'],
    "email": ["person@example.com", 'jane@example.com', 'john@example.com']
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   first     last               email
0  Corey  Schafer  person@example.com
1   Jane      Doe    jane@example.com
2   John      Doe    john@example.com

In [19]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [20]:
df.columns = ['first_name', 'last_name', 'email']

In [22]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [23]:
df

  first_name last_name               email
0      Corey   Schafer  person@example.com
1       Jane       Doe    jane@example.com
2       John       Doe    john@example.com

In [24]:
df.columns = [x.upper() for x in df.columns]

In [25]:
df

  FIRST_NAME LAST_NAME               EMAIL
0      Corey   Schafer  person@example.com
1       Jane       Doe    jane@example.com
2       John       Doe    john@example.com

In [30]:
df.columns = df.columns.str.replace(' ', '_')

In [31]:
df

  FIRST_NAME LAST_NAME               EMAIL
0      Corey   Schafer  person@example.com
1       Jane       Doe    jane@example.com
2       John       Doe    john@example.com

In [32]:
df.columns = [x.lower() for x in df.columns]

In [33]:
df

  first_name last_name               email
0      Corey   Schafer  person@example.com
1       Jane       Doe    jane@example.com
2       John       Doe    john@example.com

In [34]:
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)

In [35]:
df

   first     last               email
0  Corey  Schafer  person@example.com
1   Jane      Doe    jane@example.com
2   John      Doe    john@example.com

In [36]:
df.loc[2]

first                John
last                  Doe
email    john@example.com
Name: 2, dtype: object

In [37]:
df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']

In [38]:
df

   first     last                email
0  Corey  Schafer   person@example.com
1   Jane      Doe     jane@example.com
2   John    Smith  JohnSmith@email.com

In [40]:
df.loc[2, ['last', 'email']] = ['Doe', 'JohnDoe@email.com']

In [41]:
df

   first     last               email
0  Corey  Schafer  person@example.com
1   Jane      Doe    jane@example.com
2   John      Doe   JohnDoe@email.com

In [42]:
df.loc[2, 'last'] = 'Smith'

In [43]:
df

   first     last               email
0  Corey  Schafer  person@example.com
1   Jane      Doe    jane@example.com
2   John    Smith   JohnDoe@email.com

In [44]:
df.at[2, 'last'] = 'Doe'

In [45]:
df

   first     last               email
0  Corey  Schafer  person@example.com
1   Jane      Doe    jane@example.com
2   John      Doe   JohnDoe@email.com